#include<iostream>
using namespace std;

/*
题目意思：
N个窗口对外服务，黄线内可以容纳M个人等候，第n+m+1开始个人，在黄线后面等
给出K个人来办业务，并给出每个人办业务的时间T，问某个特定的人要在多少点能办到业务？【营业8：00-17：00】

Sample Input
2 2 7 5					2个窗口N，黄线允许2个人M，7个人来办业务K，求特定5个人的办业务时间Q
1 2 6 4 3 534 2			K个人每个人办业务需要的时间
3 4 5 6 7				Q个需要问时间的人
Sample Output
08:07					
08:06					
08:10					
17:00					
Sorry
过程如下：
			1号窗				2号窗
			  1->8:01	          2->8:02
			  3->8:07			  4->8:06
			  5->8:10			  6->17:00
								  7->sorry
文字解析：
	8:00：开始1在1号窗，2在2号窗
		  3在1号窗排队，4在2号窗排队
	8:01：1办完，3在1号窗办理，5去1号窗排队
	8:02：2办完，4去2号窗办理，6去2号窗排队
	8:06：4办完，6去2号窗办理，7去2号窗排队
	8:07：3办完，5去1号窗办理
	8:10：5办完
	17:00:6办完
	sorry：7

思路：
暂时还没有
难点：




*/
int main() 
{


}
